### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-comp-rg/providers/Microsoft.ContainerService/managedClusters/faspo-poc-aks"
        name                                = "faspo-poc-aks"
        tags                                = {}
        # (31 unchanged attributes hidden)

      + azure_active_directory_role_based_access_control {
          + azure_rbac_enabled = true
          + tenant_id          = "d46035c4-e4ae-4ea6-904f-6f343b7b5673"
        }

        # (6 unchanged blocks hidden)
    }

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "faspo-poc-argocd"
      + namespace                  = "faspo-poc-argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = true
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "server":
                  "service":
                    "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "7.8.23"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace.aks-apps-ns will be created
  + resource "kubernetes_namespace" "aks-apps-ns" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "faspo-poc-apps"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.aks-argocd-ns will be created
  + resource "kubernetes_namespace" "aks-argocd-ns" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "faspo-poc-argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.ghb-apps-deploy-key will be created
  + resource "kubernetes_secret" "ghb-apps-deploy-key" {
      + binary_data_wo                 = (write-only attribute)
      + data                           = (sensitive value)
      + data_wo                        = (write-only attribute)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "argocd.argoproj.io/secret-type" = "repository"
            }
          + name             = "faspo-poc-ghb-apps-deploy-key"
          + namespace        = "faspo-poc-argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
